app/controllers/posts_controller.rb

  def index
    @posts = Post.order(id: :asc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" ASC

  def create
    post = Post.create!(post_params)
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "旅行"], ["content", "伊勢"], ["created_at", "2020-12-20 10:51:32.288037"], ["updated_at", "2020-12-20 10:51:32.288037"]]

  def update
    @post.update!(post_params)
---
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "test"], ["updated_at", "2020-12-20 02:16:48.946644"], ["id", 2]]

  def destroy
    @post.destroy!
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 6]]